In [1]:
import numpy as np
import pandas as pd

In [2]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj = pd.Series([4, 7, -5, 3],['a','b','c','d'], dtype="int32")
obj

a    4
b    7
c   -5
d    3
dtype: int32

In [4]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'], dtype="int32")
obj2

d    4
b    7
a   -5
c    3
dtype: int32

In [5]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [6]:
obj2['a']

-5

In [7]:
obj2[2]

-5

In [8]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int32

In [9]:
obj2[1] = -7
obj2

d    4
b   -7
a   -5
c    3
dtype: int32

In [10]:
# Boolean Indexing.
obj2[obj2>0]

d    4
c    3
dtype: int32

In [11]:
obj2 * 2

d     8
b   -14
a   -10
c     6
dtype: int32

In [12]:
obj2["b" in obj2]

-7

In [13]:
"b" in obj2

True

In [14]:
"f" in obj2

False

In [15]:
# obj2["f" in obj2]

In [16]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [17]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [18]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [20]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [22]:
obj4.index

Index(['California', 'Ohio', 'Oregon', 'Texas'], dtype='object')

In [23]:
# Index changed.
obj4.index = ['Texas', 'Ohio', 'Oregon', 'California']

In [24]:
obj4

Texas             NaN
Ohio          35000.0
Oregon        16000.0
California    71000.0
dtype: float64

## DataFrames

In [25]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [26]:
# Selects first five rows.
frame.head()

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [27]:
pd.DataFrame(data, columns=("year","state","pop")) #passed Tuple of columns.

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [28]:
pd.DataFrame(data, columns=["year","state","pop","debt"]) #passed List of columns

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [29]:
pd.DataFrame(obj) # From series.

   0
a  4
b  7
c -5
d  3

In [30]:
frame.tail()

   pop   state  year
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [31]:
frame2 = frame

In [32]:
frame2["debt"] = np.arange(10,70,10)
frame2

   pop   state  year  debt
0  1.5    Ohio  2000    10
1  1.7    Ohio  2001    20
2  3.6    Ohio  2002    30
3  2.4  Nevada  2001    40
4  2.9  Nevada  2002    50
5  3.2  Nevada  2003    60

In [33]:
frame2.index = np.arange(1,7)
frame2

   pop   state  year  debt
1  1.5    Ohio  2000    10
2  1.7    Ohio  2001    20
3  3.6    Ohio  2002    30
4  2.4  Nevada  2001    40
5  2.9  Nevada  2002    50
6  3.2  Nevada  2003    60

In [34]:
# DataFrames loc method.
frame2.loc[2:4]

   pop   state  year  debt
2  1.7    Ohio  2001    20
3  3.6    Ohio  2002    30
4  2.4  Nevada  2001    40

In [35]:
frame4 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five', 'six'])
frame4

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [36]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame4['debt'] = val

In [37]:
frame4

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [38]:
frame4['debt'][['one','six']] = 10.1
frame4

/Users/shahzaibnoor/anaconda/lib/python3.5/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

       year   state  pop  debt
one    2000    Ohio  1.5  10.1
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2  10.1

In [39]:
products_data = {"name":["Horo Stick", "DS4", "PS4", "XboxOne", "Alienware"],"price":[20000, 5000, 55000, 60000, 90000],
                "units":[10, 5, 2, 10, 8]}
products = pd.DataFrame(products_data,index=np.arange(1,6))
products

         name  price  units
1  Horo Stick  20000     10
2         DS4   5000      5
3         PS4  55000      2
4     XboxOne  60000     10
5   Alienware  90000      8

In [40]:
products["sales_tax"] = np.arange(10,60,10)

In [41]:
products["discount"] = products["price"] * 0.09
products

         name  price  units  sales_tax  discount
1  Horo Stick  20000     10         10    1800.0
2         DS4   5000      5         20     450.0
3         PS4  55000      2         30    4950.0
4     XboxOne  60000     10         40    5400.0
5   Alienware  90000      8         50    8100.0

In [42]:
students_data = {"name":["Ben", "Bruce", "Shaheen", "Clark", "Diana"],"total_marks":[950, 999, 900, 850, 890]}
student_indices = np.arange(1,6)
# students_series = pd.Series(data=students_data, index=student_indices)
students = pd.DataFrame(students_data,index=student_indices)
students

      name  total_marks
1      Ben          950
2    Bruce          999
3  Shaheen          900
4    Clark          850
5    Diana          890

In [43]:
# Calculate percentage.
students["percentage"] = [(percentage/1000) * 100 for percentage in students["total_marks"]]
students["status"] = ["Pass" if percentage > 50.0 else "Fail" for percentage in students["percentage"]]
# students["status"] = ["Pass" if any(students["percentage"] > 50) else "Fail"]

In [44]:
students

      name  total_marks  percentage status
1      Ben          950        95.0   Pass
2    Bruce          999        99.9   Pass
3  Shaheen          900        90.0   Pass
4    Clark          850        85.0   Pass
5    Diana          890        89.0   Pass